; domain
(define (domain cleaning-domain)
  (:requirements :strips :typing)
  (:types office box - object)
  (:predicates
    (robot-location ?o - office)
    (box-location ?b - box ?o - office)
    (dirty ?o - office)
    (clean ?o - office)
    (empty ?o - office)
    (adjacent ?from - office ?to - office) ; New predicate
  )
  ; Define adjacent relation for simplicity (edit as per your scenario)
  (:action set-adjacent
    :parameters (?from - office ?to - office)
    :precondition (not (adjacent ?from ?to))
    :effect (adjacent ?from ?to)
  )
  (:action clean-office
    :parameters (?o - office)
    :precondition (and
      (robot-location ?o)
      (dirty ?o)
    )
    :effect (and
      (clean ?o)
      (not (dirty ?o))
    )
  )
  (:action move
    :parameters (?from - office ?to - office)
    :precondition (and
      (robot-location ?from)
      (adjacent ?from ?to)
      (empty ?to)
    )
    :effect (and
      (robot-location ?to)
      (not (robot-location ?from))
    )
  )
  (:action push
    :parameters (?b - box ?from - office ?to - office)
    :precondition (and
      (box-location ?b ?from)
      (adjacent ?from ?to)
      (empty ?to)
    )
    :effect (and
      (box-location ?b ?to)
      (not (box-location ?b ?from))
      (robot-location ?to) ; Robot moves when pushing the box
      (not (robot-location ?from))
    )
  )
)

; problem
(define (problem cleaning-test-case-4)
  (:domain cleaning-domain)
  (:objects
    o1 o2 o3 o4 o5 o6 o7 o8 o9 - office
    boxA boxB boxC boxD boxE boxF - box  ; 6 boxes tes
  )
  (:init
    (robot-location o4)
    (box-location boxA o5)  ; Box A is in o5
    (box-location boxB o6)  ; Box B is in o6
    (box-location boxC o2)  ; Box C is in o2
    (box-location boxD o3)  ; Box D is in o3
    (box-location boxE o1)  ; Box E is in o1
    (box-location boxF o9)  ; Box F is in o9
    (dirty o1) (dirty o2) (dirty o3) (dirty o4) (dirty o5) (dirty o6) (dirty o7) (dirty o8) (dirty o9)
    (empty o4) (empty o7) (empty o8) ; rooms without boxes
    ; Adjacent relations 
    (adjacent o1 o2) (adjacent o1 o4)
    (adjacent o2 o1) (adjacent o2 o3) (adjacent o2 o5)
    (adjacent o3 o2) (adjacent o3 o6)
    (adjacent o4 o1) (adjacent o4 o5) (adjacent o4 o7)
    (adjacent o5 o2) (adjacent o5 o4) (adjacent o5 o6) (adjacent o5 o8)
    (adjacent o6 o3) (adjacent o6 o5) (adjacent o6 o9)
    (adjacent o7 o4) (adjacent o7 o8)
    (adjacent o8 o5) (adjacent o8 o7) (adjacent o8 o9)
    (adjacent o9 o6) (adjacent o9 o8)
  )
  (:goal
    (and
      (robot-location o7)
      (box-location boxA o5)  ; Adjusted boxA location
      (box-location boxB o8)  ; Adjusted boxB location
      (box-location boxC o2)  ; Box C location
      (box-location boxD o3)  ; Box D location
      (box-location boxE o1)  ; Box E location
      (box-location boxF o4)  ; Box F location
    )
  )
)

; plan
1. (move o4 o7)
   deleted: (robot-location o4)
   added: (robot-location o7)
   goals met: 5 of 7
2. (set-adjacent o6 o8)
   added: (adjacent o6 o8)
   goals met: 5 of 7
3. (push boxb o6 o8)
   deleted: (box-location boxb o6)
   added: (box-location boxb o8) (robot-location o8)
   goals met: 6 of 7
4. (set-adjacent o9 o4)
   added: (adjacent o9 o4)
   goals met: 6 of 7
5. (push boxf o9 o4)
   deleted: (box-location boxf o9)
   added: (box-location boxf o4) (robot-location o4)
   goals met: 7 of 7
